id: 
name: Detect Network  Beaconing
description: |
  'Find regular HTTP beaconing behavior which may indicate malware C2'
requiredDataConnectors:
  - connectorId: 
    dataTypes:
      - CommonSecurityLog
tactics:
  - Command and Control
relevantTechniques:
  - 
query: |
    // Detect Network  Beaconing
    let starttime = 2d;
    let endtime = 1d;
    let TimeDeltaThreshold = 10;
    let TotalEventsThreshold = 15;
    let PercentBeaconThreshold = 80;
    let PrivateIPregex = @'^127\.|^10\.|^172\.1[6-9]\.|^172\.2[0-9]\.|^172\.3[0-1]\.|^192\.168\.';
    let DestIPList = CommonSecurityLog
    | where DeviceVendor == "Palo Alto Networks" and Activity == "TRAFFIC"
    | where TimeGenerated between (ago(starttime)..ago(endtime))
    | extend DestinationIPType = iff(DestinationIP matches regex PrivateIPregex,"private" ,"public" )
    | where DestinationIPType == "public"
    | summarize dcount(SourceIP) by DestinationIP
    | where dcount_SourceIP < 5
    | distinct DestinationIP;
    CommonSecurityLog
    | where DeviceVendor == "Palo Alto Networks" and Activity == "TRAFFIC"
    | where TimeGenerated between (ago(starttime)..ago(endtime))
    | where DestinationIP in ((DestIPList))
    | project TimeGenerated, DeviceName, SourceUserID, SourceIP, SourcePort, DestinationIP, DestinationPort, ReceivedBytes, SentBytes
    | sort by SourceIP asc,TimeGenerated asc, DestinationIP asc, DestinationPort asc
    | serialize
    | extend nextTimeGenerated = next(TimeGenerated, 1), nextSourceIP = next(SourceIP, 1)
    | extend TimeDeltainSeconds = datetime_diff('second',nextTimeGenerated,TimeGenerated)
    | where SourceIP == nextSourceIP
    //Whitelisting criteria/ threshold criteria
    | where TimeDeltainSeconds > TimeDeltaThreshold 
    | project TimeGenerated, TimeDeltainSeconds, DeviceName, SourceUserID, SourceIP, SourcePort, DestinationIP, DestinationPort, ReceivedBytes, SentBytes
    | summarize count(), sum(ReceivedBytes), sum(SentBytes), make_list(TimeDeltainSeconds) 
     by TimeDeltainSeconds, bin(TimeGenerated, 1h), DeviceName, SourceUserID, SourceIP, DestinationIP, DestinationPort
    | summarize (MostFrequentTimeDeltaCount, MostFrequentTimeDeltainSeconds) = arg_max(count_, TimeDeltainSeconds), TotalEvents=sum(count_), TotalSentBytes = sum(sum_SentBytes), TotalReceivedBytes = sum(sum_ReceivedBytes) 
    by bin(TimeGenerated, 1h), DeviceName, SourceUserID, SourceIP, DestinationIP, DestinationPort
    | where TotalEvents > TotalEventsThreshold 
    | extend BeaconPercent = MostFrequentTimeDeltaCount/toreal(TotalEvents) * 100
    | where BeaconPercent > PercentBeaconThreshold
    | extend timestamp = TimeGenerated, IPCustomEntity = DestinationIP, AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName
