DeviceTvmSoftwareVulnerabilities
| join kind=inner (
    DeviceTvmSoftwareVulnerabilitiesKB
    | project CveId, IsExploitAvailable
) on CveId
| summarize 
    TotalVulnerabilities = dcount(CveId),
    HighVulnerabilities = dcountif(CveId, VulnerabilitySeverityLevel == "High"),
    CriticalVulnerabilities = dcountif(CveId, VulnerabilitySeverityLevel == "Critical"),
    ExploitAvailable = dcountif(CveId, IsExploitAvailable == true)



DeviceTvmSoftwareVulnerabilities
| join kind=inner (
    DeviceTvmSoftwareVulnerabilitiesKB 
    | project CveId, IsExploitAvailable
) on CveId
| summarize 
    TotalVulnerabilities = dcount(CveId),
    HighVulnerabilities = dcountif(CveId, VulnerabilitySeverityLevel == "High"),
    CriticalVulnerabilities = dcountif(CveId, VulnerabilitySeverityLevel == "Critical"),
    ExploitAvailable = dcountif(CveId, IsExploitAvailable == true)
    by DeviceName, DeviceId
