DeviceTvmSoftwareVulnerabilities
| join kind=inner (
    DeviceTvmSoftwareVulnerabilitiesKB
    | project CveId, IsExploitAvailable
) on CveId
| summarize 
    CriticalWithExploit = dcountif(CveId, VulnerabilitySeverityLevel == "Critical" and IsExploitAvailable == true),
    HighWithExploit     = dcountif(CveId, VulnerabilitySeverityLevel == "High" and IsExploitAvailable == true),
    TotalExploit        = dcountif(CveId, IsExploitAvailable == true)
    by DeviceId, DeviceName


DeviceTvmSoftwareVulnerabilities
| join kind=inner (
    DeviceTvmSoftwareVulnerabilitiesKB
    | project CveId, IsExploitAvailable
) on CveId
| summarize 
    TotalVuln = dcount(CveId),
    Critical = dcountif(CveId, VulnerabilitySeverityLevel == "Critical"),
    High = dcountif(CveId, VulnerabilitySeverityLevel == "High"),
    ExploitAvailable = dcountif(CveId, IsExploitAvailable == true)
    by DeviceId, DeviceName
| top 5 by TotalVuln desc
